Revit 2027 API
FailureSeverity Enumeration
 Enum represents severity of a failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FailureSeverity
Public Enumeration FailureSeverity
public enum class FailureSeverity
type FailureSeverity
Members
Member name | Value | Description
DocumentCorruption | 3 |  Failure that forces Transaction to be rolled back as soon as possible due to known corruption to a document. When failure of this severity is posted, reading of information from a document is not allowed. The current transaction has to be rolled back first in order to work with the document.
Error | 2 |  Failure that cannot be ignored. If FailureMeassage of this severity is posted, the current transaction cannot be committed unless failure is resolved via appropriate FailureResolution.
None | 0 |  Represents a failure-free state of a document. This value cannot be used as an argument to construct FailureMesasage.
Warning | 1 |  Failure that can be ignored by end-user. Failures of this severity do not prevent transactions from being committed.
See Also
Reference
Autodesk.Revit.DB Namespace